[
  {
    "title": "November 2025 Meeting Minutes",
    "date": "2025-11-13",
    "summary": "The meeting covered Winter Field Day planning, club identity updates, and administrative reports, including membership and dues changes for 2026. Members also reviewed repeater site updates, accepted donated frequencies and equipment, confirmed completion of the new club banner, and discussed upcoming officer elections.",
    "link": "/files/minutes/Meeting-Minutes-11-13-25.pdf"
  },
  {
    "title": "October 2025 Meeting Minutes",
    "date": "2025-10-09",
    "summary": "The meeting addressed leadership transitions following the president’s relocation, with the club voting to leave the position vacant for the remainder of 2025 while the vice president leads. Members also approved a hospitality fund, reviewed repeater and net operations, accepted 2026 dues, and planned upcoming events including Fire Prevention Week, Winter Field Day, and year-end activities.",
    "link": "/files/minutes/Meeting-Minutes-10-09-25.pdf"
  },
  {
    "title": "September 2025 Meeting Minutes",
    "date": "2025-09-11",
    "summary": "The meeting included officer reports, discussion of meeting location changes, planning for upcoming events, and nominations for 2026 leadership roles. Members reviewed membership and repeater site updates, addressed net control staffing needs, and covered preparations for Rocky Mount, Fire Prevention Week, and Winter Field Day.",
    "link": "/files/minutes/Meeting-Minutes-09-11-25.pdf"
  },
  {
    "title": "July 2025 Meeting Minutes",
    "date": "2025-07-10",
    "summary": "The meeting included updates on Field Day results, upcoming Fox Hunts, the SOTA campout, and planning for the August club picnic, along with routine officer reports and a presentation on digital modes. Members also approved a new club banner, discussed repeater and Meshtastic work, and reviewed upcoming public service and special events.",
    "link": "/files/minutes/Meeting-Minutes-07-10-25.pdf"
  },
  {
    "title": "June 2025 Meeting Minutes",
    "date": "2025-06-12",
    "summary": "The meeting covered updates on Field Day planning, upcoming events, presentations, and club activities, along with reports from officers and coordinators. Major notes included the cancellation of the Santa Train event, reminders for volunteers, and recognition of Dennis N4DD for earning the SOTA Mountain Goat award.",
    "link": "/files/minutes/Meeting-Minutes-06-12-25.pdf"
  },
  {
    "title": "May 2025 Meeting Minutes",
    "date": "2025-05-08",
    "summary": "The meeting focused on upcoming events such as Field Day, Fun Fest, and Santa Train, along with updates on Meshtastic testing, banner redesign, and training presentations. Members discussed volunteer needs, approved a new Net Control Coordinator, and reviewed club logistics including meals, membership, and treasury updates.",
    "link": "/files/minutes/Meeting-Minutes-05-08-2025.pdf"
  },
  {
    "title": "April 2025 Meeting Minutes",
    "date": "2025-04-10",
    "summary": "The meeting focused on Field Day volunteer needs, upcoming public events, and training plans for the year, along with approval of funding for new club banners. Reports also covered repeater administration updates, Meshtastic challenges, membership dues, and planning for the Rocky Mount special event.",
    "link": "/files/minutes/Meeting-Minutes-04-10-2025.pdf"
  },
  {
    "title": "March 2025 Meeting Minutes",
    "date": "2025-03-13",
    "summary": "Members planned multiple 2025 special events, elected a new repeater trustee, approved funding for new banners, and advanced Field Day preparations. Updates included Meshtastic repairs, donated equipment, volunteer needs, and expanded outreach opportunities.",
    "link": "/files/minutes/Meeting-Minutes-03-13-2025.pdf"
  },
  {
    "title": "January 2025 Meeting Minutes",
    "date": "2025-01-09",
    "summary": "The club outlined goals for 2025, approved opening a certificate of deposit using club funds, and discussed improving meeting format and net participation. Winter Field Day plans, Meshtastic node repairs, equipment purchases, and the launch of an Elmer program for new hams were also covered.",
    "link": "/files/minutes/Meeting-Minutes-01-09-25.pdf"
  },
  {
    "title": "December 2024 Meeting Minutes",
    "date": "2024-12-12",
    "summary": "The club held officer elections for 2025, discussed Winter Field Day logistics, and committed to deploying a new Meshtastic node at the repeater site. Membership totals, future training ideas, and event participation for 2025 were also covered.",
    "link": "/files/minutes/Meeting-Minutes-12-12-24.pdf"
  },
  {
    "title": "November 2024 Meeting Minutes",
    "date": "2024-11-14",
    "summary": "Repeater issues were reported as resolved, officer election preparations continued, and Winter Field Day planning advanced. The Wooly Worm special event was reviewed as a success, including a radio giveaway donation to the club.",
    "link": "/files/minutes/Meeting-Minutes-11-14-24.pdf"
  },
  {
    "title": "October 2024 Meeting Minutes",
    "date": "2024-10-10",
    "summary": "The club reviewed emergency communications needs following Hurricane Helene, planned multiple October outreach events, and began the officer nomination process. Membership growth, financial updates, and Winter Field Day location options were also discussed.",
    "link": "/files/minutes/Meeting-Minutes-10-10-24.pdf"
  },
  {
    "title": "September 2024 Meeting Minutes",
    "date": "2024-09-12",
    "summary": "Members discussed fall special events, simplex net scheduling, and early planning for Winter Field Day. Awards were presented, and updates were shared on repeater and Meshtastic challenges.",
    "link": "/files/minutes/Meeting-Minutes-09-12-24-1.pdf"
  },
  {
    "title": "July 2024 Meeting Minutes",
    "date": "2024-07-11",
    "summary": "The meeting focused on planning the August club picnic, net operations and staffing, fall events, and community outreach efforts such as voter registration. Financial stability and membership growth were also noted.",
    "link": "/files/minutes/Meeting-Minutes-07-11-24.pdf"
  },
  {
    "title": "June 2024 Meeting Minutes",
    "date": "2024-06-13",
    "summary": "Members addressed Field Day site issues, voted to move the weekly net back to Sundays, and decided not to participate in Fun Fest. The club approved placing a solar-powered Meshtastic node at the repeater site and shared remembrances of silent key Norm Green.",
    "link": "/files/minutes/meeting-minutes-06-13-24.pdf"
  },
  {
    "title": "May 2024 Meeting Minutes",
    "date": "2024-05-09",
    "summary": "Discussion centered on Field Day planning, declining net participation after a schedule change, and preparations for the club picnic and upcoming events. Financial status, repeater maintenance needs, and outreach opportunities were also reviewed.",
    "link": "/files/minutes/Meeting-Minutes-05-09-24.pdf"
  },
  {
    "title": "April 2024 Meeting Minutes",
    "date": "2024-04-11",
    "summary": "Members voted to trial moving the weekly net to Tuesday evenings, emphasized Field Day volunteer commitments, and discussed updating club promotional materials. Repeater site cleanup progress, lifetime membership guidelines, and upcoming outreach events were also addressed.",
    "link": "/files/minutes/KARC-Meeting-Minutes-04-11-2024.pdf"
  },
  {
    "title": "March 2024 Meeting Minutes",
    "date": "2024-03-14",
    "summary": "The club approved a new 2-meter simplex net, discussed antenna build ideas, and continued preparations for Field Day and scouting merit badge training. Repeater maintenance needs and volunteer recruitment were recurring themes.",
    "link": "/files/minutes/KARC-Meeting-Minutes-03-14-2024.pdf"
  },
  {
    "title": "February 2024 Meeting Minutes",
    "date": "2024-02-08",
    "summary": "Discussion centered on NVIS net planning, Boy Scout outreach, Summer Field Day logistics, and upcoming special events including the Wooly Worm Festival. Financial updates, membership growth, and administrative filings were also covered.",
    "link": "/files/minutes/KARC-Meeting-Minutes-02-8-2024.pdf"
  },
  {
    "title": "January 2024 Meeting Minutes",
    "date": "2024-01-11",
    "summary": "The club focused on improving net operations, website visibility, and community outreach while addressing member feedback about communication gaps. Dues collection, repeater status, scouting involvement, and numerous 2024 event opportunities were also reviewed.",
    "link": "/files/minutes/KARC-Meeting-Minutes-01-11-2024-2.pdf"
  },
  {
    "title": "December 2023 Meeting Minutes",
    "date": "2023-12-14",
    "summary": "Officers for 2024 were elected, repeater upgrade funding was approved, and Winter Field Day plans with HHART were confirmed. Members also discussed website maintenance, outreach expansion, and future special event participation.",
    "link": "/files/minutes/KARC-Meeting-Minutes-12-14-2023.pdf"
  },
  {
    "title": "November 2023 Meeting Minutes",
    "date": "2023-11-09",
    "summary": "The meeting focused on officer nominations, repeater improvements, Winter Field Day coordination with HHART, and expanded community outreach planning. Concerns about declining participation in POTA and SOTA programs were also raised.",
    "link": "/files/minutes/KARC-Meeting-Minutes-11-9-2023.pdf"
  },
  {
    "title": "October 2023 Meeting Minutes",
    "date": "2023-10-12",
    "summary": "The club approved funding for repeater upgrades, transitioned the Repeater Trustee role, and expanded discussion on future events, outreach, and participation challenges. Officer nominations for 2024 and continued concerns about volunteer engagement were key topics.",
    "link": "/files/minutes/KARC-Meeting-Minutes-10-12-2023.pdf"
  },
  {
    "title": "September 2023 Meeting Minutes",
    "date": "2023-09-14",
    "summary": "Members reviewed repeater performance, approved a donation to the Netherland Inn event, and discussed Winter Field Day site options and communication improvements. Awards were presented, and future training and outreach initiatives were planned. ",
    "link": "/files/minutes/KARC-Meeting-Minutes-9-14-2023.pdf"
  },
  {
    "title": "July 2023 Meeting Minutes",
    "date": "2023-07-13",
    "summary": "The meeting emphasized Field Day success, SOTA awards, repeater interference issues, and the need for more net control volunteers. Plans for upcoming presentations, CW classes, and fall outreach events were also outlined.",
    "link": "/files/minutes/KARC-Meeting-Minutes-7-13-2023.pdf"
  },
  {
    "title": "June 2023 Meeting Minutes",
    "date": "2023-06-08",
    "summary": "Members approved funding for Summer Field Day, welcomed new members, and discussed Fire Prevention Week coordination and repeater improvements. Participation in POTA/SOTA and the need for additional net control volunteers were emphasized.",
    "link": "/files/minutes/KARC-Meeting-Minutes-6-8-2023.pdf"
  },
  {
    "title": "May 2023 Meeting Minutes",
    "date": "2023-05-11",
    "summary": "The meeting highlighted antenna theory training, Field Day planning, and outreach efforts including the Greenville Hamfest. Awards were presented, upcoming presentations scheduled, and ongoing repeater and net participation challenges discussed.",
    "link": "/files/minutes/KARC-Meeting-Minutes-5-11-2023.pdf"
  },
  {
    "title": "April 2023 Meeting Minutes",
    "date": "2023-04-13",
    "summary": "Members reviewed strong participation in combined SOTA/POTA activities, approved repeater electrical upgrades under budget, and discussed Field Day and Fire Prevention Week planning. Continued needs included net control volunteers, repeater enhancements, and educational programs.",
    "link": "/files/minutes/KARC-Meeting-Minutes-4-13-2023.pdf"
  },
  {
    "title": "November 2022 Meeting Minutes",
    "date": "2022-11-10",
    "summary": "Members voted on 2023 officers, finalized the move to the Food City meeting location, and discussed Winter Field Day participation and repeater expansion plans. Updates included fox hunt leadership changes, ongoing training programs, and outreach opportunities. ",
    "link": "/files/minutes/KARC-Meeting-Minutes-11-10-2022.pdf"
  },
  {
    "title": "October 2022 Meeting Minutes",
    "date": "2022-10-13",
    "summary": "The club confirmed a new meeting location, continued officer election preparations, and reviewed repeater progress including Echolink activation. Special events, training programs, and collaboration ideas such as a regional hamfest were also explored.",
    "link": "/files/minutes/KARC-Meeting-Minutes-10-13-2022.pdf"
  },
  {
    "title": "September 2022 Meeting Minutes",
    "date": "2022-09-08",
    "summary": "Members reviewed repeater assessments, strong membership numbers, and plans for Winter Field Day, Fire Prevention Week, and the Netherland Inn special event. Education initiatives, fox hunts, and future infrastructure needs were also discussed.",
    "link": "/files/minutes/KARC-Meeting-Minutes-9-8-2022.pdf"
  },
  {
    "title": "July 2022 Meeting Minutes",
    "date": "2022-07-14",
    "summary": "The meeting was largely informational, highlighting an exceptionally successful Summer Field Day, repeater committee updates, and planning for the upcoming club picnic and fall special events. Ongoing youth training, NVIS planning, and repeater improvements remained active topics. ",
    "link": "/files/minutes/KARC-Meeting-Minutes-7-14-2022.pdf"
  },
  {
    "title": "June 2022 Meeting Minutes",
    "date": "2022-06-09",
    "summary": "The club reviewed major progress at the repeater site, recognized awards for SOTA, POTA, and fox hunting, and finalized plans for Field Day at Warrior’s Path. Youth training programs, banking updates, and future infrastructure planning were also discussed.",
    "link": "/files/minutes/Meeting-Minutes-6-9-2022.pdf"
  },
  {
    "title": "May 2022 Meeting Minutes",
    "date": "2022-05-12",
    "summary": "The club announced its new 501(c)(3) nonprofit status, reviewed solar power upgrades at the repeater site, and discussed NVIS build challenges and youth training efforts. Banking updates, meeting location options, and ongoing SOTA/POTA activities were also covered.",
    "link": "/files/minutes/KARC-Meeting-Minutes-5-12-2022.pdf"
  },
  {
    "title": "April 2022 Meeting Minutes",
    "date": "2022-04-10",
    "summary": "Members presented quarterly awards, approved funding for a solar power upgrade at the repeater site, and confirmed the club’s 501(c)(3) nonprofit status. Updates included EchoLink testing, NVIS build scheduling, youth training efforts, and future site workdays.",
    "link": "/files/minutes/Meeting-Minutes-4-10-2022.pdf"
  },
  {
    "title": "March 2022 Meeting Minutes",
    "date": "2022-03-10",
    "summary": "The club recognized member achievements, reported receipt of a new 440 MHz repeater and donated equipment, and discussed repeater workdays and lifetime membership criteria. Outreach plans included a school ham radio event and preparation to transfer and test EchoLink equipment. ",
    "link": "/files/minutes/Meeting-Minutes-3-10-2022.pdf"
  },
  {
    "title": "February 2022 Meeting Minutes",
    "date": "2022-02-10",
    "summary": "The club recognized multiple member achievements, approved the purchase of a new 440 MHz repeater, and reviewed Winter Field Day results and repeater upgrade priorities. Youth outreach through JROTC, nonprofit status progress, and plans for Summer Field Day were also discussed.",
    "link": "/files/minutes/Meeting-Minutes-2-10-2022.pdf"
  },
  {
    "title": "January 2022 Meeting Minutes",
    "date": "2022-01-01",
    "summary": "The club recognized outgoing officers, introduced organizational improvements, and outlined plans to enhance communication, events, and IT systems. Winter Field Day participation and repeater activity updates were also discussed, along with progress toward formal nonprofit structure.",
    "link": "/files/minutes/Minutes-Jan-2022.pdf"
  },
  {
    "title": "November 2021 Meeting Minutes",
    "date": "2021-11-01",
    "summary": "The meeting highlighted repeater site improvements, special event results, officer nominations for 2022, and educational outreach through a JROTC radio program. Members also addressed nonprofit status questions and logistics for storing club equipment.",
    "link": "/files/minutes/Minutes-Nov-2021.pdf"
  },
  {
    "title": "September 2021 Meeting Minutes",
    "date": "2021-09-01",
    "summary": "Members received updates on the repeater construction progress, including tower installation and expenses, and discussed upcoming special events and outreach activities. Ongoing nets, membership growth, and plans for the Netherland Inn Harvest Festival were also covered.",
    "link": "/files/minutes/Minutes-Sep-2021.pdf"
  },
  {
    "title": "July 2021 Meeting Minutes",
    "date": "2021-07-01",
    "summary": "The club reviewed finances, welcomed new members, and reported on a successful Field Day with community engagement and media coverage. Plans were discussed for Fun Fest operations, upcoming fall events, and the annual club picnic.",
    "link": "/files/minutes/Minutes-Jul-2021.pdf"
  },
  {
    "title": "June 2021 Meeting Minutes",
    "date": "2021-06-10",
    "summary": "Members received updates on significant repeater site progress, confirmed continued meetings at Randall’s due to facility restrictions, and discussed upcoming Field Day, club picnic, and fall events. Leadership transitions, youth outreach opportunities, and future officer nominations were also addressed.",
    "link": "/files/minutes/KARC-6_10_21.pdf"
  },
  {
    "title": "May 2021 Meeting Minutes",
    "date": "2021-05-13",
    "summary": "The meeting focused on ongoing repeater site work, backup power planning, and approval of a special event station for Bays Mountain Park’s 50th anniversary. Field Day logistics and regulatory updates for license testing were also covered.",
    "link": "/files/minutes/KARC-5_13_21.pdf"
  },
  {
    "title": "April 2021 Meeting Minutes",
    "date": "2021-04-08",
    "summary": "Members approved creating a petty cash fund, reviewed improved repeater antenna performance, and discussed potential special event operations at Bays Mountain Park. Net control staffing updates and upcoming community events were also noted. ",
    "link": "/files/minutes/KARC-4_8_21.pdf"
  },
  {
    "title": "March 2021 Meeting Minutes",
    "date": "2021-03-11",
    "summary": "The club reviewed repeater improvements, approved funding for equipment and site upgrades, and filled the vacant secretary position. Plans for Echolink relocation, tower work, and continued success of the Sunday night net were also discussed.",
    "link": "/files/minutes/KARC-3_11_21.pdf"
  }
]
